Repository: xinux-org/conf-editor
Catalog: po/*.po
Languages: uz

source: Save Changes?
uz: O‘zgarishlar saqlansinmi?

source: Unsaved changes will be lost. You should rebuild your system now to ensure you configured everything properly. You can also save your configuration, however is is possible that your configuration is save in an unbuildable state.
uz: Saqlanmagan o‘zgarishlar o‘chib ketadi. Hamma narsani to‘g‘ri sozlaganingizga ishonch hosil qilish uchun tizimingizni hoziroq qayta qurishingiz kerak. Konfiguratsiyangizni saqlashingiz ham mumkin, lekin konfiguratsiyangiz qurilmaydigan holatda saqlangan bo‘lishi mumkin.

source: Quit
uz: Chiqish

source: Save
uz: Saqlash

source: Rebuild
uz: Qayta qurish

source: Description
uz: Tavsif

source: Type
uz: Tur

source: Default
uz: Standart

source: Example
uz: Misol

source: Value
uz: Qiymat

source: True
uz: To‘g‘ri

source: False
uz: Yolgʻon

source: Attribute Value
uz: Atribut qiymati

source: Reset
uz: Asliga qaytarish

source: Clear
uz: Tozalash

source: Welcome the NixOS Configuration Editor!
uz: NixOS konfiguratsiya muharririga xush kelibsiz!

source: If your configuration file is not in the default location, you can change it here.
uz: Agar konfiguratsiya faylingiz birlamchi joylashuvda bo‘lmasa, uni bu yerda o‘zgartirishingiz mumkin.

source: Configuration file
uz: Konfiguratsiya fayli

source: Flake file
uz: Flake fayl

source: If you are using flakes, you can specify the path to your flake.nix file here.
uz: Agar flakes ishlatayotgan bo‘lsangiz, bu yerda flake.nix fayliga yo‘lni ko‘rsatishingiz mumkin.

source: Continue
uz: Davom ettirish

source: Could not load cache
uz: Kesh yuklanmadi

source: Try connecting to the internet or launching the application again
uz: Internetga ulaning yoki ilovani qaytadan ishga tushiring

source: Could not load options
uz: Variantlar yuklanmadi

source: Try launching the application again
uz: Ilovani qaytadan ishga tushiring

source: Error loading configuration file
uz: Konfiguratsiya faylini yuklashda xatolik yuz berdi

source: Retry
uz: Qayta urinish

source: Preferences
uz: Sozlamalar

source: Attributes
uz: Atributlar

source: Options
uz: Variantlar

source: No options found!
uz: Hech qanday variant topilmadi!

source: Try a different search
uz: Boshqa qidiruvni sinang

source: Use nix flakes
uz: Nix fleyklardan foydalaning

source: Flake arguments (--flake path/to/flake.nix#&lt;THIS ENTRY&gt;)
uz: Fleyk argumentlari (--flake path/to/flake.nix#&lt;THIS ENTRY&gt;)

source: Configuration Editor
uz: Konfiguratsiya muharriri

source: Loading...
uz: Yuklanmoqda...

source: Building...
uz: Qurilmoqda...

source: Done!
uz: Tamom!

source: Rebuild successful!
uz: Qayta qurish muvaffaqiyatli amalga oshirildi!

source: Error!
uz: Xatolik!

source: Rebuild failed! See below for error message.
uz: Qayta qurish amalga oshmadi! Xatolik xabari uchun quyidagilarga qarang.

source: Close
uz: Yopish

source: Save Anyways
uz: Baribir saqlash

source: Reset Changes
uz: O‘zgarishlarni tiklash

source: Keep Editing
uz: Tahrirlashda davom etish

source: Enter a new <name> value
uz: Yangi <name> qiymatini kiriting

source: Cancel
uz: Bekor qilish

source: Invalid configuration
uz: Konfiguratsiya yaroqsiz

source: Please fix the errors and try again.
uz: Iltimos, xatolarni tuzating va qayta urining.

source: Keep changes
uz: O‘zgarishlarni saqlash

source: Edit
uz: Tahrirlash
